{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "mask_value": -1, "trainable": true, "batch_input_shape": [null, 5, 16], "name": "masking_1"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "stateful": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_constraint": null, "use_bias": true, "bias_constraint": null, "name": "lstm_1", "return_state": false, "kernel_constraint": null, "go_backwards": false, "unroll": false, "trainable": true, "recurrent_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"dtype": "float32", "activation": "linear", "units": 8, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "batch_input_shape": [null, 32], "trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}